# №1
# Напишите программу, которая определит максимальный и минимальный неотрицательный рост среди пяти введенных значений.

# def sort_tall_small(n):
#     numbers = []
#     for i in range (n):
#         while True:
#             try:
#                 print('Введите рост по одному значению на строку.')
#                 value = int(input('Введите рост:'))
#                 if value >= 0:
#                     numbers.append(value)
#                     break              
#             except ValueError:
#                 print('Нужно ввести число')
#     return numbers

# def main():
#     try:
#         n = int(input('Введите количество человек: '))
#         if n <= 0:
#             print('Количество должно быть положительным')
#             return
#     except ValueError:
#         print('Нужно ввести число')
#         return

#     numbers = sort_tall_small(n)

#     if len(numbers) == 0:
#         print('Не найдено')
#     else:
#         print(f'Максимальный рост: {max(numbers)} ')
#         print(f'Минимальный рост: {min(numbers)}')

# if __name__ == "__main__":
#     main()

# №2

'''На перекрестке стоит экспериментальный светофор. Он работает по следующим правилам:
• Если на дороге нет машин (дальность датчика 50 метров), он всегда горит желтым
мигающим.
• Если машины есть только на главной дороге, для нее горит зеленый.
• Если машины есть только на второстепенной, для нее горит зеленый.
• Если машины есть на обеих дорогах, приоритет всегда у главной.
Напишите программу, которая принимает два целых числа: расстояние до ближайшей
машины на главной и на второстепенной дороге. Выведите цвет светофора для главной
дороги.
'''

# def regulator(main_line,second_line):
#     car_on_main = main_line <= 50
#     car_on_second = second_line <= 50

#     if not car_on_main and not car_on_second:
#         print('blink yellow                         blink yellow')
#     elif car_on_main and not car_on_second:
#         print('green                                red')
#     elif not car_on_main and car_on_second:
#         print('red                                  green')
#     elif car_on_main and car_on_second:
#         print('green                                red')

# def main():
#     try:
#         main_line,second_line = map(int,input('Введите два числа: \nрасстояние до ближайшей машины на главной и на второстепенной: ').split())
#     except ValueError:
#         print('Введите число.')
#         return

#     print('Светофор на главной     Светофор на второстепенной')
#     regulator(main_line,second_line)

# if __name__ == "__main__":
#     main()
    
# №3
'''Реализовать игру царство драконов'''

# from random import *

# def run_tail():

#     while True:
#         try:
#             cave = randint(1, 2)
#             choose = int(input("""Вы находитесь в землях, заселенных драконами. Перед собой вы видите две
# пещеры. В одной из них — дружелюбный дракон, который готов поделиться с вами своими сокровищами. Во второй — жадный и голодный дракон,
# который мигом вас съест. В какую пещеру вы войдете? (нажмите клавишу 1 или 2)\n"""))
#             if choose == 1 or choose == 2:
#                 if cave == 1:
#                     print('Вы встретили дружелюбного дракона, который поделился с вами своими сокровищами.\n')
#                     break
#                 else:
#                     print('Вы встретили голодного дракона, который вас съел.\n')
#                     break
                
#         except ValueError:
#             print('Введите число 1 или 2')


# def main():
#     while True:
#         try:
#             choose = int(input('Начнем игру "Царство драконов"? (1 - да/2 - нет) '))
#             if choose == 1:
#                 run_tail()
#                 continue
#             elif choose == 2:
#                 print('Увы, без вашего желание ничего не произойдет.')
#                 return
#         except ValueError:
#             print('Введите 1 или 2')

# if __name__ == "__main__":
#     main()

# №4
"""“Високосный год по-марсиански”
Год на Марсе длится N марсианских дней. Ученые решили ввести на Марсе високосные
годы, чтобы календарь лучше синхронизировался с орбитальным периодом. Правила следующие:
• Если номер года не делится на 5, то он обычный.
• Если номер года делится на 5, но не делится на 50, то он високосный.
• Если номер года делится на 50, но не делится на 250, то он обычный.
• Если номер года делится на 250, то он особо високосный (у него свой особый
признак).
Напишите программу, которая принимает номер марсианского года и выводит его тип:
common, leap или superleap.
"""

# def mars_or_not(days):
#     if days % 5 != 0:
#         return 'common'
#     if days % 5 == 0 and days % 50 != 0:
#         return 'leap' 
#     if days % 50 == 0 and days % 250 != 0:
#         return 'common'
#     if days % 250 == 0:
#         return 'superleap'
# def main():
#     while True:
#         try:
#             days = int(input('Введите количество дней: '))
#             if days < 0:
#                 print('Введите положительное число')
#             else:
#                 break
#         except ValueError:
#             print('Введите число.')

#     result = mars_or_not(days)

#     print(result)

# if __name__ == "__main__":
#     main()

# №5
'''“Классификация треугольников”
Все треугольники могут быть отнесены к тому или иному классу (равнобедренные, равносторонние и разносторонние) на основании длин их сторон.
• Равносторонний треугольник характеризуется одинаковой длиной всех трех сторон
• Равнобедренный треугольник характеризуется одинаковой длиной двух сторон из
трех
• Разносторонний треугольник имеет все стороны разной длины
Напишите программу, которая будет запрашивать у пользователя длины всех трех
сторон треугольника и выдавать сообщение о том, к какому типу следует его относить.'''

# def say_triang(a,b,c):
#     if a == b == c:
#         print('Треугольник равносторонний')
#     elif a == b or b == c or a == c:
#         print('Треугольник равнобедренный')
#     else:
#         print('Треугольник разносторонний')

# def main():

#     while True:
#         try:
#             print('Классификация треугольников\nВведите числа так (N N N)')
#             a, b, c = map(int,input().split(" "))
#             if a < 0 or b < 0 or c < 0:
#                 print('Стороны треугольника не должны быть отрицательными\n')
#                 continue
#             else:
#                 break
#         except ValueError:
#             print('Введите целое число вот таким образом (N N N)')

#     say_triang(a,b,c)

# if __name__ == "__main__":
#     main()

# № 6
'''Количество дней в месяце варьируется от 28 до 31. Очередная ваша программа должна
запрашивать у пользователя название месяца и отображать количество дней в нем. Поскольку года мы не учитываем, для февраля можно вывести сообщение о том, что этот
месяц может состоять как из 28, так и из 29 дней, чтобы учесть фактор високосного года.'''

# №7
'''“Проверка хода в шахматах”
Программа получает на вход координаты двух клеток шахматной доски (например, a2 и
c3). Определите, может ли слон сделать ход из первой клетки во вторую за один ход.
• Учтите, что слон ходит только по диагонали.
• Если ход возможен, выведите YES.
• Если нет, выведите NO.
'''

# def main():
#     while True:
#         try:
#             cell1, cell2 = map(str, input('Введите координаты двух клеток на шахматной доске\nПрограмма определит может ли слон за один ход из первой клетки во вторую перейти\nПример a1 b2\nВ формате (N N):').split())

#         except ValueError:
#             print('Введите координаты двух клеток N N')