# A1

"""Однажды трое лучших друзей Петя, Вася и Тоня решили создать команду и участвовать
в соревновании по программированию. Обычно на соревнованиях по программированию
участникам предлагается несколько задач. Еще перед началом друзья договорились, что
они будут реализовывать задачу, если как минимум двое из них придумали и уверены в
решении, в противном случае ребята не будут писать решение этой задачи.
На этом соревновании организаторы предложили n задач. Для каждой задачи известно, кто из друзей придумал и уверен в ее решении. Помогите друзьям найти количество
задач, по которым они будут писать решение.
"""

# from random import choices
# def take_task():
#     while True:
#         try:
#             task = int(input("Введите количество задач\n"))
#             now_task = []
#             cnt = 0
#             for _ in range(task):
#                 now_task += choices(range(0,2), k = 3)
#             for i in range (0, len(now_task), 3):
#                 triple = now_task[i : i + 3]

#                 if sum(triple) >= 2:
#                     cnt += 1
            
#             print(cnt)
#         except ValueError:
#             print("Введите целое число")
# def info():
#     print("В первой строке - число задач. Программа определит, количество задач, в которых 2 из 3 друзей уверены.\n")

# def main():
#     info()
#     take_task()

# if __name__ == "__main__":
#     main()

# A2
"""Дан следующий список:
lst = [[1, 2, ['Ok!', 3]], ['list', 4], 5]
Выведите единственную строку:
Ok!
"""

# def main():
#     lst = [[1, 2, ['Ok!', 3]], ['list', 4], 5]
#     print(lst[0][2][0])

# if __name__ == "__main__":
#     main()

# def uniql():
#     print("Введите все слова в одну строку. Программа выдаст уникальные")
#     text = input().strip()
#     uniql_word = []
#     for word in text:
#         if word not in uniql_word:
#             uniql_word.append(word)
#     print("".join(uniql_word))

# def main():
#     uniql()

# if __name__ == "__main__":
#     main()

# A
"""Для выигрыша главного приза необходимо, чтобы шесть номеров на лотерейном билете
совпали с шестью числами, выпавшими случайным образом в диапазоне от 1 до 49 во
время очередного тиража.
Напишите программу, которая будет случайным образом генерировать лотерейный билет — то есть шесть уникальных чисел в диапазоне от 1 до 49."""

from random import randint

def ticket():
    lucky_number = []
    for i in range(6):
        lucky_number.append(randint(0+1,50))
    print("".join(lucky_number))

def main():
    ticket()

if __name__ == "__main__":
    main()